app/Controllers/Deposit.php

SELECT *
FROM `files`
---
    public function index()
    {
        echo view('templates/meheader01');
        $data['files'] = $this->db->table('files')->get()->getResult();